Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ནི་ཤིན་ཏུ་དབེན་པའོ། །དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་དང་། ཡང་དག་པར་སྤོང་བ་རྣམས་དང་།
en: The other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, are absolutely void.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་རྣམས་དང་། སྟོབས་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ནི་ཤིན་ཏུ་དབེན་པའོ།
en: The applications of mindfulness, the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path are absolutely void.

source: །རྣམ་པར་ཐར་པ་རྣམས་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་ནི་ཤིན་ཏུ་དབེན་པའོ། །མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་།
en: The aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, and wishlessness are absolutely void.

source: གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་དང་། མི་འཇིགས་པ་རྣམས་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ནི་ཤིན་ཏུ་དབེན་པའོ།
en: The extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, and the distinct qualities of the buddhas are absolutely void. [

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ནི་ཤིན་ཏུ་དབེན་པའོ། །རབ་འབྱོར་ཇི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཤིན་ཏུ་དབེན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་།
en: The goals], up to and including all-aspect omniscience, are absolutely void. “

source: བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཤིན་ཏུ་དབེན་པ་དང་། ནང་སྟོང་པ་ཉིད་ཤིན་ཏུ་དབེན་པ་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་ཤིན་དུ་དབེན་པ་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ཤིན་ཏུ་དབེན་པ་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའི་བར་དུ་ཤིན་ཏུ་དབེན་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་ཤིན་ཏུ་དབེན་པ་དེ་བཞིན་དུ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་ཡང་ཤིན་ཏུ་དབེན་པའོ། །རབ་འབྱོར་གལ་ཏེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཤིན་ཏུ་དབེན་པར་མ་གྱུར། བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་།
en: Subhūti, just as the perfection of wisdom is absolutely void, the perfection of meditative concentration, the perfection of perseverance, the perfection of tolerance, the perfection of ethical discipline, and the perfection of generosity are absolutely void; the emptiness of internal phenomena is absolutely void; [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, are absolutely void; the applications of mindfulness are absolutely void; [the other causal attributes], up to and including the noble eightfold path, are absolutely void; [the fruitional attributes and goals], up to and including all-aspect omniscience, are absolutely void; and so, too, the attainment of consummate buddhahood in unsurpassed, complete enlightenment is absolutely void. “

source: བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཤིན་དུ་དབེན་པར་མ་གྱུར། ནང་སྟོང་པ་ཉིད་ཤིན་ཏུ་དབེན་པར་མ་གྱུར། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་ཤིན་ཏུ་དབེན་པར་མ་གྱུར། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ཤིན་ཏུ་དབེན་པར་མ་གྱུར། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའི་བར་དུ་ཤིན་ཏུ་དབེན་པར་མ་གྱུར། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་ཤིན་ཏུ་དབེན་པར་མ་གྱུར་ན། དེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པར་མི་འགྱུར་རོ། །དེ་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་།
en: Subhūti, if the perfection of wisdom were not absolutely void; if the perfection of meditative concentration, the perfection of perseverance, the perfection of tolerance, the perfection of ethical discipline, and the perfection of generosity were not absolutely void; if the emptiness of internal phenomena were not absolutely void; if [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, were not absolutely void; if the applications of mindfulness were not absolutely void; if [the other causal attributes], up to and including the noble eightfold path, were not absolutely void; and if [the fruitional attributes and goals], up to and including all-aspect omniscience, were not absolutely void, then there would be no perfection of wisdom; there would be no perfection of meditative concentration, perfection of perseverance, perfection of tolerance, perfection of ethical discipline, or perfection of generosity; there would be no emptiness of internal phenomena; there would be no [other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities; there would be no applications of mindfulness; there would be no [other causal attributes], up to and including the noble eightfold path; and there would be no [fruitional attributes or goals], up to and including all-aspect omniscience.

source: བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པར་མི་འགྱུར་རོ། །དེ་ནང་སྟོང་པ་ཉིད་དུ་མི་འགྱུར་རོ། །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་མི་འགྱུར་རོ། །དེ་དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་སུ་མི་འགྱུར་རོ། །འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའི་བར་དུ་མི་འགྱུར་རོ། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་མི་འགྱུར་རོ། །རབ་འབྱོར་དེ་བས་ན་ཇི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཤིན་ཏུ་དབེན་པ་དང་། ཇི་ལྟར་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཤིན་ཏུ་དབེན་པ་དང་།
en: Therefore, Subhūti, inasmuch as the perfection of wisdom is absolutely void; inasmuch as the perfection of meditative concentration, the perfection of perseverance, the perfection of tolerance, the perfection of ethical discipline, and the perfection of generosity are absolutely void; inasmuch as the emptiness of internal phenomena is absolutely void, and [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities are absolutely void; inasmuch as the applications of mindfulness are absolutely void, and [the other causal attributes], up to and including the noble eightfold path, are absolutely void; and inasmuch as [the fruitional attributes and goals], up to and including all-aspect omniscience, are absolutely void, [bodhisattva great beings] will not attain consummate buddhahood in unsurpassed, complete enlightenment dependent on the perfection of wisdom.

source: ཇི་ལྟར་ནང་སྟོང་པ་ཉིད་ཤིན་ཏུ་དབེན་པ་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་ཤིན་ཏུ་དབེན་པ་དང་། ཇི་ལྟར་དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ཤིན་དུ་དབེན་པ་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའི་བར་དུ་ཤིན་ཏུ་དབེན་པ་དང་།
en: How can voidness attain buddhahood through voidness?

source: ཇི་ལྟར་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་ཤིན་ཏུ་དབེན་པ་དེ་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་མ་བརྟེན་པར་ཡང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱའོ། །དབེན་པས་དབེན་པ་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱ་སྟེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱ་བས་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་མ་བརྟེན་པར་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱའོ།
en: Since there will be no attainment of consummate buddhahood in unsurpassed, complete enlightenment, they will not attain consummate buddhahood in unsurpassed, complete enlightenment dependent on the perfection of wisdom.” {

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་དོན་ཟབ་མོ་ལ་སྤྱོད་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: V: 48} “Blessed Lord, bodhisattva great beings practice with a profound objective.” “

source: རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་དོན་ཟབ་མོ་ལ་སྤྱོད་པའོ། །རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ལྟར་དོན་ཟབ་མོ་ལ་སྤྱོད་ཅིང་།
en: Subhūti, bodhisattva great beings do practice with a profound objective.

source: འདི་ལྟ་སྟེ། ཉན་ཐོས་ཀྱི་ས་འམ། རང་སངས་རྒྱས་ཀྱི་སར་འགྱུར་བའི་དོན་དེ་མངོན་དུ་མི་བྱེད་པ་ནི་དཀའ་བ་བྱེད་པའོ། །གསོལ་པ།
en: That is to say, in not actualizing the objective of resorting to the level of the śrāvakas or the level of the pratyekabuddhas, they do that which is difficult.” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པའི་དོན་བདག་གིས་འཚལ་བ་ལྟར་ན་དཀའ་བ་ཅུང་ཟད་ཀྱང་མི་བགྱིད་ན་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དཀའ་བ་བགྱིད་པ་ལགས།
en: Blessed Lord, as I understand the meaning spoken by the Blessed One, if they do not incur the slightest difficulty, how do bodhisattva great beings do what is difficult?

source: དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་དེ་ནི་འདི་ལྟར་གང་མངོན་དུ་བགྱི་བའི་དོན་དེ་ཡང་མི་དམིགས།
en: If one were to ask why, Blessed Lord, it is because they do not apprehend any objective that they should realize whatsoever.

source: གང་གིས་མངོན་དུ་བགྱི་བའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དེ་ཡང་མི་དམིགས།
en: Nor do they apprehend the perfection of wisdom through which [their objective] would be realized.

source: གང་མངོན་དུ་བགྱི་བའི་ཆོས་དེ་ཡང་མི་དམིགས་ཏེ།
en: Nor do they apprehend anything that would bring about that realization.

source: བཅོམ་ལྡན་འདས་ཆོས་ཐམས་ཅད་གང་མངོན་དུ་བགྱིས་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བའི་དོན་མངོན་དུ་བགྱི་བ་དེ་ལྟ་བུ་ཡང་གང་ཞིག་མཆིས། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡང་གང་ཞིག་གིས་མངོན་དུ་བགྱི། ཆོས་མངོན་དུ་བགྱི་བ་དེ་ལྟ་བུ་ཡང་གང་ཞིག་མཆིས། བཅོམ་ལྡན་འདས་འདི་ནི་མི་དམིགས་པའི་སྤྱོད་པ་སྟེ།
en: Blessed Lord, they engage in nonapprehension with respect to all phenomena that can be realized—whatever, Blessed Lord, may be the objective to be realized, such as the attainment of consummate buddhahood in unsurpassed, complete enlightenment, whatever the perfection of wisdom through which it is to be realized, or whatever may be the attributes that realize it.

source: དེ་ལ་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཐམས་ཅད་ལ་མུན་པ་མ་མཆིས་པ་འཐོབ་པའོ།
en: Bodhisattva great beings who practice this acquire a state that is without blindness with respect to all phenomena.

source: །བཅོམ་ལྡན་འདས་གལ་ཏེ་དེ་སྐད་དུ་བསྟན་པ་ལ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སེམས་མི་ཞུམ་ཡོངས་སུ་མི་འཇུམ་ཞིང་། མི་འཇིགས་མི་དངང་། སྐྲག་པར་མི་འགྱུར་ན། བཅོམ་ལྡན་འདས་དེ་ལྟར་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་སྟེ།
en: Blessed Lord, if, when this is taught, the minds of bodhisattva great beings are not discouraged, not utterly cowed, not afraid, and not terrified, in that case, Blessed Lord, bodhisattva great beings who practice accordingly do practice the perfection of wisdom.

source: དེ་ནི་སྤྱོད་དོ་ཞེས་བགྱི་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་།
en: They do not observe that which they are practicing.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་།
en: They do not observe the perfection of wisdom.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ། །ཞེས་བགྱི་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: They do not observe that they will attain consummate buddhahood in unsurpassed, complete enlightenment. “

source: །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་དེ་ནི་འདི་སྙམ་དུ་བདག་གིས་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱིས་ནི་བསྲིང་བར་བྱ་སྟེ།
en: Blessed Lord, bodhisattva great beings who practice the perfection of wisdom do not think, ‘I should shun the level of the śrāvakas and the level of the pratyekabuddhas.

source: བདག་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཉེ་བར་གྱུར་ཏོ་སྙམ་ཡང་མི་བགྱིད་དོ།
en: I am approaching all-aspect omniscience.’

source: །བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ་དཔེར་ན། ནམ་མཁའ་ནི་འདི་ལྟར་བདག་ནི་ལ་ལ་དང་ནི་རིང་ངོ་། །ལ་ལ་དང་ནི་ཉེའོ་ཞེས་བགྱི་བར་མི་སེམས་སོ།
en: Blessed Lord, space does not think, ‘I am remote from some and near to others.’

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་ནམ་མཁའ་ལ་བྱེ་བྲག་མ་མཆིས་ཤིང་མི་གཡོ་བ་དང་། རྣམ་པར་རྟོག་པ་མ་མཆིས་པའི་སླད་དུ་སྟེ།
en: If one were to ask why, Blessed Lord, it is because space is not particularized; it is immobile and nonconceptual.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ཡང་འདི་ལྟར་བདག་ལས་ཉན་ཐོས་སམ། རང་སངས་རྒྱས་ཀྱི་ས་ནི་རིང་གི །
en: In the same way, Blessed Lord, though bodhisattva great beings practice the perfection of wisdom, they do not think, ‘The level of the śrāvakas or the level of the pratyekabuddhas is remote from me.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ནི་ཉེའོ་ཞེས་བགྱི་བར་མི་སེམས་སོ།
en: Unsurpassed, complete enlightenment is near.’

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམ་པར་མི་རྟོག་པའི་སླད་དུའོ།
en: If one were to ask why, Blessed Lord, it is because the perfection of wisdom is nonconceptual. {

source: །བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ་དཔེར་ན།
en: Ki.

source: སྒྱུ་མའི་སྐྱེས་བུ་ནི་འདི་ལྟར་བདག་ལས་སྒྱུ་མ་ནི་རིང་ངོ་།
en: V: 49} “Blessed Lord, it is just as an illusory man does not think, ‘This illusion is remote from me.

source: །སྒྱུ་མའི་མཁན་པོ་ནི་ཉེའོ།
en: The illusionist is near.

source: །སྐྱེ་བོའི་ཚོགས་འདི་ལྟར་འདུས་པ་ནི་བདག་ལས་རིང་ངོ་ཞེའམ། ཉེའོ་ཞེས་བགྱི་བར་མི་སེམས་སོ།
en: The crowd of people gathered here are remote from me or near.’

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་སྒྱུ་མའི་སྐྱེས་བུ་ནི་རྣམ་པར་མི་རྟོག་པའི་སླད་དུ་སྟེ།
en: If one were to ask why, Blessed Lord, it is because an illusory man is without concepts.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ཡང་འདི་ལྟར་བདག་ལས་ཉན་ཐོས་སམ། རང་སངས་རྒྱས་ཀྱི་ས་ནི་རིང་ངོ་།
en: In the same way, Blessed Lord, though bodhisattva great beings practice the perfection of wisdom, they do not think, ‘The level of the śrāvakas or the level of the pratyekabuddhas is remote from me.

source: །བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ནི་ཉེའོ་ཞེས་བགྱི་བར་མི་སེམས་སོ།
en: Unsurpassed, complete enlightenment is near.’

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམ་པར་མི་རྟོག་པའི་སླད་དུའོ། །བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ་དཔེར་ན།
en: If one were to ask why, Blessed Lord, it is because the perfection of wisdom is nonconceptual. “

source: གཟུགས་བརྙན་ནི་འདི་ལྟར་བདག་ལས་དམིགས་པ་གང་གིས་གཟུགས་བརྙན་འབྱུང་བ་དེ་ནི་ཉེ།
en: Blessed Lord, it is just as a reflection does not think, ‘This apprehending of the reflection that arises is near to me.

source: གང་མེ་ལོང་དང་སྣོད་ཆུས་གང་བའི་ནང་དུ་བྱུང་བ་དེ་ནི་བདག་ལས་རིང་ངོ་ཞེས་བགྱི་བར་མི་སེམས་སོ། །དེ་ཅིའི་སླད་དུ་ཞེ་ན།
en: The mirror or the vessel full of water on which it appears is remote from me.’

source: བཅོམ་ལྡན་འདས་གཟུགས་བརྙན་རྣམ་པར་མི་རྟོག་པའི་སླད་དུ་སྟེ།
en: If one were to ask why, Blessed Lord, it is because a reflection is without concepts.

source: །བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་ནི་སྡུག་པ་དང་མི་སྡུག་པ་མ་མཆིས་སོ།
en: Blessed Lord, in the perfection of wisdom there is nothing pleasant or unpleasant.

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན། དེ་ནི་འདི་ལྟར་གང་གིས་འདི་ལ་སྡུག་པ་འམ། མི་སྡུག་པར་འགྱུར་བའི་ངོ་བོ་ཉིད་མི་དམིགས་པའི་སླད་དུའོ།
en: If one were to ask why, it is because no essential nature is apprehended through which it would become pleasant or unpleasant.

source: །བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ་དཔེར་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལ་ནི་སྡུག་པ་འམ་མི་སྡུག་པར་འགྱུར་བ་གང་ཡང་མ་མཆིས་སོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་ཡང་སྡུག་པ་འམ་མི་སྡུག་པར་འགྱུར་བ་གང་ཡང་མ་མཆིས་སོ། །བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། དཔེར་ན།
en: Blessed Lord, just as to the tathāgatas, arhats, completely awakened buddhas there is nothing pleasant or unpleasant, in the same way, Blessed Lord, in the perfection of wisdom, too, there is nothing pleasant or unpleasant. “

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ནི་རྣམ་པར་རྟོག་པ་ཐམས་ཅད་སྤངས་པའོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ཡང་རྣམ་པར་རྟོག་པ་ཐམས་ཅད་སྤངས་པ་སྟེ།
en: Blessed Lord, just as the tathāgatas, arhats, completely awakened buddhas, have abandoned all concepts, in the same way, Blessed Lord, though bodhisattva great beings practice the perfection of wisdom, they abandon all concepts.

source: དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམ་པར་མི་རྟོག་པའི་སླད་དུའོ། །བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ་དཔེར་ན།
en: If one were to ask why, Blessed Lord, it is because the perfection of wisdom is nonconceptual. “

source: དེ་བཞིན་གཤེགས་པའི་སྤྲུལ་པ་ནི་འདི་ལྟར་ང་ལས་ཉན་ཐོས་སམ། རང་སངས་རྒྱས་ཀྱི་ས་ནི་རིང་ངོ་།
en: Blessed Lord, a phantom emanation of the Tathāgata does not think, ‘The level of the śrāvakas or the level of the pratyekabuddhas is remote from me.

source: །བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ནི་ཉེའོ་ཞེས་བགྱི་བར་མི་དགོངས་སོ།
en: Unsurpassed, complete enlightenment is near.’

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དང་། དེ་བཞིན་གཤེགས་པའི་སྤྲུལ་པ་རྣམ་པར་མི་རྟོག་པའི་སླད་དུ་སྟེ།
en: If one were to ask why, Blessed Lord, it is because the Tathāgata and a phantom emanation of the Tathāgata are without concepts.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ཡང་། འདི་ལྟར་བདག་ལས་ཉན་ཐོས་ཀྱི་ས་འམ། རང་སངས་རྒྱས་ཀྱི་ས་ནི་རིང་ངོ་།
en: In the same way, Blessed Lord, though bodhisattva great beings practice the perfection of wisdom, they do not think, ‘The level of the śrāvakas or the level of the pratyekabuddhas is remote from me.

source: །བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ་དཔེར་ན། དེ་བཞིན་གཤེགས་པས་སྤྲུལ་པ་ཞིག་སྤྲུལ་པ་མཛད་ན། དེ་ནི་དོན་གང་གི་སླད་དུ་སྤྲུལ་པའི་དོན་དེ་སྦྱོར་ཏེ། སྤྲུལ་པ་ནི་མི་རྟོག་རྣམ་པར་མི་རྟོག་གོ །
en: Blessed Lord, it is just as when the tathāgatas create a phantom emanation—it engages with the purpose for which it was emanated, but the phantom does not think and is without concepts. {

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡང་དོན་གང་གི་སླད་དུ་བརྗོད་པའི་དོན་དེ་ཡང་བགྱིད་དེ།
en: Ki.V: 50} In the same way, Blessed Lord, the perfection of wisdom, too, acts according to the objective for which it is expressed.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དེ་ནི་མི་རྟོག་རྣམ་པར་མི་རྟོག་པའོ། །བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ་དཔེར་ན། ཤིང་མཁན་ནམ།
en: This perfection of wisdom does not think and it is nonconceptual. “

source: ཤིང་མཁན་གྱི་སློབ་མ་མཁས་པ་ཞིག་གིས་བུད་མེད་ཀྱི་གཟུགས་སམ། སྐྱེས་པའི་གཟུགས་སམ། གླང་པོའི་གཟུགས་སམ། རྟའི་གཟུགས་སམ། གླང་གི་གཟུགས་ཀྱི་འཁྲུལ་འཁོར་ཞིག་སྦྱར་ན།
en: Blessed Lord, it is just as when a carpenter or the skilled apprentice of a carpenter makes a machine in the shape of a woman, or in the shape of a man, or in the shape of an elephant, or in the shape of a horse, or in the shape of a bull—though this machine may perform according to its objective, it is without concepts.

source: དེ་དོན་གང་གི་སླད་དུ་བགྱིས་པའི་དོན་དེ་བསྒྲུབ་ཀྱང་། འཁྲུལ་འཁོར་དེ་ནི་རྣམ་པར་མི་རྟོག་གོ །བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡང་དོན་གང་གི་སླད་དུ་བརྗོད་པའི་དོན་དེ་བགྱིད་ཀྱང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དེ་ནི་རྣམ་པར་མི་རྟོག་པའོ། །དེ་ནས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས།
en: In the same way, Blessed Lord, the perfection of wisdom also acts according to the objective for which it is expressed, but this perfection of wisdom is nonconceptual.” {

source: ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Ki.

source: །ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འབའ་ཤིག་རྣམ་པར་མི་རྟོག་པ་ཡིན་ནམ། འོན་ཏེ་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་།
en: V: 38} Thereupon the venerable Śāradvatīputra addressed the venerable Subhūti: “Venerable Subhūti, is it only the perfection of wisdom that is nonconceptual, or are the perfection of meditative concentration, the perfection of perseverance, the perfection of tolerance, the perfection of ethical discipline, and the perfection of generosity also nonconceptual?” “

source: སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡང་རྣམ་པར་མི་རྟོག་པ་ཡིན། རབ་འབྱོར་གྱིས་སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡང་རྣམ་པར་མི་རྟོག་པའོ།
en: Venerable Śāradvatīputra,” replied Subhūti, “the perfection of meditative concentration is also nonconceptual.

source: །བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡང་རྣམ་པར་མི་རྟོག་པའོ། །སྨྲས་པ།
en: The perfection of perseverance, the perfection of tolerance, the perfection of ethical discipline, and the perfection of generosity are also nonconceptual.” “

source: ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ཅི་གཟུགས་ཀྱང་རྣམ་པར་མི་རྟོག་པ་ཡིན་ནམ།
en: Venerable Subhūti, are physical forms also nonconceptual?

source: ཚོར་བ་དང་འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཡང་རྣམ་པར་མི་རྟོག་པ་ཡིན་ནམ།
en: Are feelings, perceptions, formative predispositions, and consciousness also nonconceptual?

source: སྐྱེ་མཆེད་དང་ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ཡང་རྣམ་པར་མི་རྟོག་པ་ཡིན་ནམ།
en: Are the sense fields, sensory elements, and links of dependent origination also nonconceptual?

source: ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་ཀྱང་རྣམ་པར་མི་རྟོག་པ་ཡིན་ནམ།
en: Are the perfections also nonconceptual?

source: སྟོང་པ་ཉིད་ཐམས་ཅད་ཀྱང་རྣམ་པར་མི་རྟོག་པ་ཡིན་ནམ།
en: Are all the aspects of emptiness also nonconceptual?

source: བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ཡང་རྣམ་པར་མི་རྟོག་པ་ཡིན་ནམ།
en: Are the thirty-seven factors conducive to enlightenment also nonconceptual?

source: འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམ་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་ཀྱང་རྣམ་པར་མི་རྟོག་པ་ཡིན་ནམ།
en: Are the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, and the formless absorptions also nonconceptual?

source: རྣམ་པར་ཐར་པ་རྣམས་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་ཡང་རྣམ་པར་མི་རྟོག་པ་ཡིན་ནམ།
en: Are the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, and wishlessness also nonconceptual?

source: མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ཀྱང་རྣམ་པར་མི་རྟོག་པ་ཡིན་ནམ།
en: Are the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways also nonconceptual?

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་དང་། མི་འཇིགས་པ་རྣམས་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཀྱང་རྣམ་པར་མི་རྟོག་པ་ཡིན་ནམ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ཡང་རྣམ་པར་མི་རྟོག་པ་ཡིན་ནམ།
en: Are the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, and the distinct qualities of the buddhas also nonconceptual?

source: འདུས་བྱས་ཀྱི་ཁམས་དང་། འདུས་མ་བྱས་ཀྱི་ཁམས་ཀྱང་རྣམ་པར་མི་རྟོག་པ་ཡིན་ནམ།
en: Are the conditioned elements and the nonconditioned elements also nonconceptual?” “

source: རབ་འབྱོར་གྱིས་སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ཆོས་ཐམས་ཅད་ནི་རྣམ་པར་མི་རྟོག་པའོ།
en: Venerable Śāradvatīputra, all phenomena are nonconceptual!”

source: ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གལ་ཏེ་དེ་ལྟར་ཆོས་ཐམས་ཅད་རྣམ་པར་མི་རྟོག་པ་ཡིན་ན། སེམས་ཅན་དམྱལ་བ་དང་། བྱོལ་སོང་གི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་དང་། ལྷ་དང་མི་འགྲོ་བ་ལྔར་འཁོར་བ་ཞེས་ཐ་དད་དུ་དབྱེ་བ་ཅི་ལས་འོངས། རྒྱུན་དུ་ཞུགས་པ་དང་། ལན་ཅིག་ཕྱིར་འོང་བ་དང་།
en: Venerable Subhūti, if all phenomena are nonconceptual, how has this differentiation come about with regard to the cycle of existence with its five realms of living beings, namely the denizens of the hells, the animal domain, the world of Yama, the world of the gods, and the world of humankind?

source: ཕྱིར་མི་འོང་བ་དང་། དགྲ་བཅོམ་པ་དང་། རང་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་དང་། སངས་རྒྱས་བཅོམ་ལྡན་འདས་སུ་བརྗོད་པའང་ཅི་ལས་གྱུར།
en: How are those who have entered the stream to nirvāṇa, those who are destined for only one more rebirth, those who will no longer be reborn, those who are arhats, those who are pratyekabuddhas, those who are bodhisattvas, and those who are the lord buddhas to be designated?” “
